Autodesk.Revit.DB.Document.DocumentAbortOpenStatus.UpgraderTransactionRolledBack
An upgrader's transaction failed to commit.
This typically indicates data corruption or constraint violations during upgrade.

Autodesk.Revit.DB.Document.DocumentAbortOpenStatus.DontAbortOpen
Document opening should proceed normally (no abort).

Autodesk.Revit.DB.Document.DocumentAbortOpenStatus
Status indicating whether document opening should be aborted and why.
Used internally by document upgraders to signal critical failures during the opening process.
Remarks:
This is an internal enum used to communicate between managed (C#) upgraders and
native C++ document loading infrastructure. It is not part of the public API.